/* Welcome to the SQL mini project. You will carry out this project partly in
the PHPMyAdmin interface, and partly in Jupyter via a Python connection.

This is Tier 2 of the case study, which means that there'll be less guidance for you about how to setup
your local SQLite connection in PART 2 of the case study. This will make the case study more challenging for you: 
you might need to do some digging, aand revise the Working with Relational Databases in Python chapter in the previous resource.

Otherwise, the questions in the case study are exactly the same as with Tier 1. 


/* PART 2: SQLite

Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook 
for the following questions.

In [1]:
import sqlite3
import pandas as pd

In [2]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("SELECT * FROM Facilities")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

In [3]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
    facility,
    SUM(cost) AS revenue
FROM (
    SELECT name AS facility, facid,
    CASE WHEN memid = 0 THEN slots * guestcost
        ELSE slots * membercost END AS cost
    FROM Bookings
    INNER JOIN Facilities USING(facid)
    INNER JOIN Members USING(memid)
    ) AS subquery
GROUP BY facid
HAVING revenue < 1000
ORDER BY revenue DESC;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df

        facility  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

/* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */

In [4]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
     m1.surname || ", " || m1.firstname AS membername, 
     m2.surname || ", " || m2.firstname AS referrer
FROM Members AS m1
LEFT JOIN Members AS m2
ON m1.recommendedby = m2.memid
WHERE m1.memid <> 0
ORDER BY membername;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df.style.hide_index()

/* Q12: Find the facilities with their usage by member, but not guests */

In [5]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility,
        COUNT(DISTINCT memid) AS member_usage
    FROM Bookings
    LEFT JOIN Facilities USING(facid)
    WHERE memid <> 0
    GROUP BY facid
    ORDER BY facid;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
print(df.to_string(index=False))

       facility  member_usage
 Tennis Court 1            23
 Tennis Court 2            21
Badminton Court            24
   Table Tennis            25
 Massage Room 1            24
 Massage Room 2            12
   Squash Court            24
  Snooker Table            22
     Pool Table            27

In [6]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility,
        SUM(slots*0.5) AS usage_hours
    FROM Bookings
    Left JOIN Facilities USING(facid)
    WHERE memid <> 0
    GROUP BY facid
    ORDER BY facid;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
print(df.to_string(index=False))

       facility  usage_hours
 Tennis Court 1        478.5
 Tennis Court 2        441.0
Badminton Court        543.0
   Table Tennis        397.0
 Massage Room 1        442.0
 Massage Room 2         27.0
   Squash Court        209.0
  Snooker Table        430.0
     Pool Table        428.0

In [7]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility, surname || ", " || firstname AS member,
        COUNT(memid) AS member_usage
    FROM Bookings
    LEFT JOIN Facilities USING(facid)
    LEFT JOIN Members USING (memid)
    WHERE memid <> 0
    GROUP BY facid, memid
    ORDER BY facid, memid;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df.set_index(['facility', 'member'], inplace=True)
print(df.to_string())

                                          member_usage
facility        member
Tennis Court 1  Smith, Tracy                        30
                Rownam, Tim                          6
                Joplette, Janice                    19
                Butters, Gerald                     57
                Tracy, Burton                       31
                Dare, Nancy                         25
                Boothe, Tim                          4
                Stibbons, Ponder                     1
                Owen, Charles                       17
                Jones, David                        25
                Baker, Anne                          6
                Farrell, Jemima                      1
                Smith, Jack                         22
                Bader, Florence                      1
                Baker, Timothy                      14
                Pinker, David                       16
                Genting, Matthew                     1
                Coplin, Joan                         7
                Sarwin, Ramnaresh                    5
                Jones, Douglas                       9
                Farrell, David                       6
                Hunt, John                           4
                Crumpet, Erica                       1
Tennis Court 2  Smith, Darren                       19
                Smith, Tracy                         2
                Rownam, Tim                          6
                Joplette, Janice                     8
                Butters, Gerald                      3
                Tracy, Burton                        3
                Dare, Nancy                         11
                Boothe, Tim                         52
                Stibbons, Ponder                    31
                Owen, Charles                       41
                Jones, David                        30
                Baker, Anne                         35
                Farrell, Jemima                      1
                Smith, Jack                          1
                Bader, Florence                      8
                Baker, Timothy                       7
                Sarwin, Ramnaresh                   11
                Rumney, Henrietta                    1
                Farrell, David                       1
                Purview, Millicent                   1
                Hunt, John                           4
Badminton Court Smith, Darren                      132
                Smith, Tracy                        32
                Rownam, Tim                          4
                Butters, Gerald                     20
                Tracy, Burton                        2
                Dare, Nancy                         10
                Boothe, Tim                         12
                Stibbons, Ponder                    16
                Owen, Charles                        6
                Jones, David                         8
                Baker, Anne                         10
                Farrell, Jemima                      7
                Smith, Jack                         12
                Bader, Florence                      9
                Baker, Timothy                       7
                Pinker, David                        7
                Mackenzie, Anna                     30
                Sarwin, Ramnaresh                    7
                Jones, Douglas                       2
                Worthington-Smyth, Henry             4
                Purview, Millicent                   2
                Tupperware, Hyacinth                 1
                Hunt, John                           2
                Crumpet, Erica                       2
Table Tennis    Smith, Darren                       28
                Smith, Tracy                        28
                Rownam, Tim                         69
                Joplette, Janice                     9
                Butters, Gerald                      1
                Tracy, Burton                       24
                Dare, Nancy                          5
                Boothe, Tim                          4
                Stibbons, Ponder                     3
                Owen, Charles                       24
                Jones, David                        11
                Baker, Anne                          1
                Farrell, Jemima                     12
                Smith, Jack                          5
                Bader, Florence                     42
                Baker, Timothy                      24
                Pinker, David                       17
                Genting, Matthew                    26
                Mackenzie, Anna                     16
                Coplin, Joan                        21
                Sarwin, Ramnaresh                    3
                Worthington-Smyth, Henry             3
                Purview, Millicent                   6
                Hunt, John                           1
                Crumpet, Erica                       2
Massage Room 1  Smith, Darren                       28
                Smith, Tracy                         6
                Rownam, Tim                         80
                Joplette, Janice                    12
                Butters, Gerald                     32
                Tracy, Burton                       31
                Dare, Nancy                         19
                Boothe, Tim                         36
                Stibbons, Ponder                    19
                Owen, Charles                       11
                Jones, David                        19
                Baker, Anne                          3
                Farrell, Jemima                     29
                Smith, Jack                         27
                Baker, Timothy                      24
                Pinker, David                        3
                Genting, Matthew                    25
                Mackenzie, Anna                      1
                Coplin, Joan                         1
                Sarwin, Ramnaresh                    8
                Worthington-Smyth, Henry             1
                Tupperware, Hyacinth                 1
                Hunt, John                           3
                Crumpet, Erica                       2
Massage Room 2  Rownam, Tim                          2
                Joplette, Janice                     2
                Butters, Gerald                      1
                Dare, Nancy                          5
                Owen, Charles                        2
                Jones, David                         4
                Baker, Anne                          2
                Smith, Jack                          1
                Bader, Florence                      2
                Genting, Matthew                     1
                Coplin, Joan                         2
                Sarwin, Ramnaresh                    3
Squash Court    Smith, Darren                       14
                Smith, Tracy                         6
                Joplette, Janice                    14
                Butters, Gerald                      9
                Tracy, Burton                       35
                Boothe, Tim                         12
                Stibbons, Ponder                     2
                Owen, Charles                        7
                Jones, David                         8
                Baker, Anne                         49
                Farrell, Jemima                      8
                Smith, Jack                          9
                Bader, Florence                      2
                Baker, Timothy                       5
                Pinker, David                        3
                Mackenzie, Anna                      2
                Coplin, Joan                         1
                Sarwin, Ramnaresh                    2
                Jones, Douglas                       1
                Rumney, Henrietta                    2
                Farrell, David                       1
                Purview, Millicent                   1
                Tupperware, Hyacinth                 1
                Hunt, John                           1
Snooker Table   Smith, Darren                       12
                Smith, Tracy                        45
                Joplette, Janice                    68
                Butters, Gerald                     34
                Tracy, Burton                       20
                Dare, Nancy                         23
                Boothe, Tim                         43
                Stibbons, Ponder                    20
                Owen, Charles                       22
                Jones, David                         2
                Farrell, Jemima                     21
                Smith, Jack                          5
                Bader, Florence                     33
                Pinker, David                       16
                Genting, Matthew                     1
                Mackenzie, Anna                      7
                Coplin, Joan                        10
                Sarwin, Ramnaresh                   18
                Rumney, Henrietta                   14
                Farrell, David                       1
                Purview, Millicent                   1
                Tupperware, Hyacinth                 5
Pool Table      Smith, Darren                       28
                Smith, Tracy                        61
                Rownam, Tim                        241
                Joplette, Janice                    27
                Butters, Gerald                      6
                Tracy, Burton                       30
                Dare, Nancy                         19
                Boothe, Tim                         25
                Stibbons, Ponder                    12
                Owen, Charles                        1
                Jones, David                         8
                Baker, Anne                         12
                Farrell, Jemima                      1
                Smith, Jack                          7
                Bader, Florence                     23
                Baker, Timothy                      85
                Pinker, David                        9
                Genting, Matthew                    18
                Mackenzie, Anna                     70
                Coplin, Joan                        11
                Sarwin, Ramnaresh                   13
                Jones, Douglas                       2
                Rumney, Henrietta                    3
                Farrell, David                      25
                Worthington-Smyth, Henry            33
                Purview, Millicent                   5
                Tupperware, Hyacinth                 8

In [8]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility, surname || ", " || firstname AS member,
        SUM(slots*0.5) AS usage_hours
    FROM Bookings
    LEFT JOIN Facilities USING(facid)
    LEFT JOIN Members USING(memid)
    WHERE memid <> 0
    GROUP BY facid, memid
    ORDER BY facid, memid;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df.set_index(['facility', 'member'], inplace=True)
print(df.to_string())

                                          usage_hours
facility        member
Tennis Court 1  Smith, Tracy                     46.5
                Rownam, Tim                       9.0
                Joplette, Janice                 28.5
                Butters, Gerald                  85.5
                Tracy, Burton                    46.5
                Dare, Nancy                      40.5
                Boothe, Tim                       6.0
                Stibbons, Ponder                  1.5
                Owen, Charles                    25.5
                Jones, David                     42.0
                Baker, Anne                       9.0
                Farrell, Jemima                   1.5
                Smith, Jack                      37.5
                Bader, Florence                   1.5
                Baker, Timothy                   22.5
                Pinker, David                    25.5
                Genting, Matthew                  1.5
                Coplin, Joan                     10.5
                Sarwin, Ramnaresh                 7.5
                Jones, Douglas                   13.5
                Farrell, David                    9.0
                Hunt, John                        6.0
                Crumpet, Erica                    1.5
Tennis Court 2  Smith, Darren                    28.5
                Smith, Tracy                      3.0
                Rownam, Tim                       9.0
                Joplette, Janice                 12.0
                Butters, Gerald                   4.5
                Tracy, Burton                     4.5
                Dare, Nancy                      16.5
                Boothe, Tim                      84.0
                Stibbons, Ponder                 48.0
                Owen, Charles                    70.5
                Jones, David                     49.5
                Baker, Anne                      57.0
                Farrell, Jemima                   1.5
                Smith, Jack                       1.5
                Bader, Florence                  12.0
                Baker, Timothy                   10.5
                Sarwin, Ramnaresh                18.0
                Rumney, Henrietta                 1.5
                Farrell, David                    1.5
                Purview, Millicent                1.5
                Hunt, John                        6.0
Badminton Court Smith, Darren                   216.0
                Smith, Tracy                     51.0
                Rownam, Tim                       6.0
                Butters, Gerald                  31.5
                Tracy, Burton                     3.0
                Dare, Nancy                      15.0
                Boothe, Tim                      18.0
                Stibbons, Ponder                 24.0
                Owen, Charles                     9.0
                Jones, David                     12.0
                Baker, Anne                      15.0
                Farrell, Jemima                  10.5
                Smith, Jack                      18.0
                Bader, Florence                  13.5
                Baker, Timothy                   10.5
                Pinker, David                    10.5
                Mackenzie, Anna                  48.0
                Sarwin, Ramnaresh                10.5
                Jones, Douglas                    3.0
                Worthington-Smyth, Henry          7.5
                Purview, Millicent                3.0
                Tupperware, Hyacinth              1.5
                Hunt, John                        3.0
                Crumpet, Erica                    3.0
Table Tennis    Smith, Darren                    28.0
                Smith, Tracy                     28.0
                Rownam, Tim                      75.0
                Joplette, Janice                  9.0
                Butters, Gerald                   1.0
                Tracy, Burton                    24.0
                Dare, Nancy                       5.0
                Boothe, Tim                       4.0
                Stibbons, Ponder                  3.0
                Owen, Charles                    25.0
                Jones, David                     11.0
                Baker, Anne                       1.0
                Farrell, Jemima                  12.0
                Smith, Jack                       5.0
                Bader, Florence                  43.0
                Baker, Timothy                   24.0
                Pinker, David                    17.0
                Genting, Matthew                 27.0
                Mackenzie, Anna                  16.0
                Coplin, Joan                     23.0
                Sarwin, Ramnaresh                 3.0
                Worthington-Smyth, Henry          3.0
                Purview, Millicent                7.0
                Hunt, John                        1.0
                Crumpet, Erica                    2.0
Massage Room 1  Smith, Darren                    29.0
                Smith, Tracy                      6.0
                Rownam, Tim                      88.0
                Joplette, Janice                 12.0
                Butters, Gerald                  33.0
                Tracy, Burton                    31.0
                Dare, Nancy                      19.0
                Boothe, Tim                      38.0
                Stibbons, Ponder                 20.0
                Owen, Charles                    11.0
                Jones, David                     20.0
                Baker, Anne                       3.0
                Farrell, Jemima                  34.0
                Smith, Jack                      27.0
                Baker, Timothy                   25.0
                Pinker, David                     3.0
                Genting, Matthew                 26.0
                Mackenzie, Anna                   1.0
                Coplin, Joan                      1.0
                Sarwin, Ramnaresh                 8.0
                Worthington-Smyth, Henry          1.0
                Tupperware, Hyacinth              1.0
                Hunt, John                        3.0
                Crumpet, Erica                    2.0
Massage Room 2  Rownam, Tim                       2.0
                Joplette, Janice                  2.0
                Butters, Gerald                   1.0
                Dare, Nancy                       5.0
                Owen, Charles                     2.0
                Jones, David                      4.0
                Baker, Anne                       2.0
                Smith, Jack                       1.0
                Bader, Florence                   2.0
                Genting, Matthew                  1.0
                Coplin, Joan                      2.0
                Sarwin, Ramnaresh                 3.0
Squash Court    Smith, Darren                    15.0
                Smith, Tracy                      6.0
                Joplette, Janice                 15.0
                Butters, Gerald                   9.0
                Tracy, Burton                    39.0
                Boothe, Tim                      12.0
                Stibbons, Ponder                  2.0
                Owen, Charles                     7.0
                Jones, David                      8.0
                Baker, Anne                      55.0
                Farrell, Jemima                   8.0
                Smith, Jack                      11.0
                Bader, Florence                   2.0
                Baker, Timothy                    5.0
                Pinker, David                     3.0
                Mackenzie, Anna                   2.0
                Coplin, Joan                      1.0
                Sarwin, Ramnaresh                 2.0
                Jones, Douglas                    1.0
                Rumney, Henrietta                 2.0
                Farrell, David                    1.0
                Purview, Millicent                1.0
                Tupperware, Hyacinth              1.0
                Hunt, John                        1.0
Snooker Table   Smith, Darren                    12.0
                Smith, Tracy                     45.0
                Joplette, Janice                 71.0
                Butters, Gerald                  36.0
                Tracy, Burton                    20.0
                Dare, Nancy                      23.0
                Boothe, Tim                      45.0
                Stibbons, Ponder                 20.0
                Owen, Charles                    22.0
                Jones, David                      2.0
                Farrell, Jemima                  22.0
                Smith, Jack                       5.0
                Bader, Florence                  33.0
                Pinker, David                    16.0
                Genting, Matthew                  1.0
                Mackenzie, Anna                   7.0
                Coplin, Joan                     10.0
                Sarwin, Ramnaresh                18.0
                Rumney, Henrietta                14.0
                Farrell, David                    1.0
                Purview, Millicent                1.0
                Tupperware, Hyacinth              6.0
Pool Table      Smith, Darren                    14.0
                Smith, Tracy                     32.0
                Rownam, Tim                     141.0
                Joplette, Janice                 13.5
                Butters, Gerald                   3.0
                Tracy, Burton                    15.0
                Dare, Nancy                       9.5
                Boothe, Tim                      13.0
                Stibbons, Ponder                  6.0
                Owen, Charles                     0.5
                Jones, David                      4.0
                Baker, Anne                       6.0
                Farrell, Jemima                   0.5
                Smith, Jack                       3.5
                Bader, Florence                  11.5
                Baker, Timothy                   47.5
                Pinker, David                     4.5
                Genting, Matthew                  9.0
                Mackenzie, Anna                  41.5
                Coplin, Joan                      5.5
                Sarwin, Ramnaresh                 6.5
                Jones, Douglas                    1.0
                Rumney, Henrietta                 1.5
                Farrell, David                   12.5
                Worthington-Smyth, Henry         18.5
                Purview, Millicent                2.5
                Tupperware, Hyacinth              4.5

/* Q13: Find the facilities usage by month, but not guests */

In [9]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility, STRFTIME('%m', starttime) AS month,
        SUM(slots*0.5) AS usage_hours
    FROM Bookings
    LEFT JOIN Facilities USING(facid)
    WHERE memid <> 0
    GROUP BY facid, month
    ORDER BY facid, month;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df.set_index(['facility', 'month'], inplace=True)
print(df.to_string())

                       usage_hours
facility        month
Tennis Court 1  07           100.5
                08           169.5
                09           208.5
Tennis Court 2  07            61.5
                08           172.5
                09           207.0
Badminton Court 07            82.5
                08           207.0
                09           253.5
Table Tennis    07            49.0
                08           148.0
                09           200.0
Massage Room 1  07            83.0
                08           158.0
                09           201.0
Massage Room 2  07             4.0
                08             9.0
                09            14.0
Squash Court    07            25.0
                08            92.0
                09            92.0
Snooker Table   07            70.0
                08           158.0
                09           202.0
Pool Table      07            55.0
                08           151.5
                09           221.5

In [10]:
with sqlite3.connect("sqlite_db_pythonsqlite.db") as conn:
    curr = conn.cursor()
    data = curr.execute("""SELECT  
        name AS facility, STRFTIME('%m', starttime) AS month,
        COUNT(memid) AS usage
    FROM Bookings
    LEFT JOIN Facilities USING(facid)
    WHERE memid <> 0
    GROUP BY facid, month
    ORDER BY facid, month;""")
    df = pd.DataFrame(data.fetchall())
    names = curr.description
columns = list(map(lambda x: x[0], names))
df.columns = columns
df.set_index(['facility', 'month'], inplace=True)
print(df.to_string())

                       usage
facility        month
Tennis Court 1  07        65
                08       111
                09       132
Tennis Court 2  07        41
                08       109
                09       126
Badminton Court 07        51
                08       132
                09       161
Table Tennis    07        48
                08       143
                09       194
Massage Room 1  07        77
                08       153
                09       191
Massage Room 2  07         4
                08         9
                09        14
Squash Court    07        23
                08        85
                09        87
Snooker Table   07        68
                08       154
                09       199
Pool Table      07       103
                08       272
                09       408